Revit 2024 API
FormattedText.SetAllCapsStatus Method
Overload List
Name | Description
SetAllCapsStatus(Boolean)
 Sets the characters in the entire text to be in all caps or not.
SetAllCapsStatus(TextRange, Boolean)
 Sets the characters in a given text range to be in all caps or not.
See Also
FormattedText Class
FormattedText Members
Autodesk.Revit.DB Namespace